hw2_rottenpotatoes/app/controllers/movies_controller.rb

SELECT DISTINCT rating FROM "movies"
SELECT "movies".* FROM "movies" WHERE ( rating in ('G','R','PG') ) ORDER BY '--- !map:ActiveSupport::HashWithIndifferentAccess
---
  def index

    @all_ratings = Movie.select("DISTINCT rating").map(&:rating)
    @movies = Movie.all